Долома/src/Documents/ПроизводственнаяСводка/ПроизводственнаяСводка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственнаяСводка</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.ПроизводствоСводка</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БелокМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖирМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДойныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МолокоНаВыпойку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныйБелок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныйЖир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднесуточныйУдой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоварностьМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВаловыйНадой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФуражныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднесуточныйУдойФуражный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Долома/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Долома/src/InformationRegisters/ПроизводствоСводка/ПроизводствоСводка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводствоСводка</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоДойныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднесуточныйУдой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТоварностьМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖирМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БелокМолока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФуражныхКоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднесуточныйУдойФуражный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Documents/ПроизводственнаяСводка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать 	= Истина;
	Движения.ПроизводствоСводка.Записывать 	= Истина;

	НовоеДвижение 				= Движения.ТоварыНаСкладах.ДобавитьПриход();
	НовоеДвижение.Период		= Дата;
	НовоеДвижение.Склад			= Склад;
	НовоеДвижение.Номенклатура	= Справочники.Номенклатура.Молоко;
	НовоеДвижение.Количество	= ВаловыйНадой;
	
	Если ЗначениеЗаполнено(МолокоНаВыпойку) Тогда
		
		НовоеДвижение 				= Движения.ТоварыНаСкладах.ДобавитьРасход();
		НовоеДвижение.Период		= Дата;
		НовоеДвижение.Склад			= Склад;
		НовоеДвижение.Номенклатура	= Справочники.Номенклатура.Молоко;
		НовоеДвижение.Количество	= МолокоНаВыпойку;
		
	КонецЕсли;
	
	НовоеДвижение 								= Движения.ПроизводствоСводка.Добавить();
	НовоеДвижение.Ферма 						= Ферма;
	НовоеДвижение.КоличествоДойныхКоров 		= КоличествоДойныхКоров;
	НовоеДвижение.Период						= Дата;
	НовоеДвижение.СреднесуточныйУдой 			= СреднесуточныйУдой;
	НовоеДвижение.ТоварностьМолока 				= ТоварностьМолока;
	НовоеДвижение.ЖирМолока 					= ЖирМолока;
	НовоеДвижение.БелокМолока 					= БелокМолока;
	НовоеДвижение.КоличествоФуражныхКоров 		= КоличествоФуражныхКоров;
	НовоеДвижение.СреднесуточныйУдойФуражный 	= СреднесуточныйУдойФуражный;

КонецПроцедуры
